<h1><center>Simple Linear Regression of Titanic Data</center></h1>


<h4>About this Notebook</h4>
In this notebook, we learn how to use scikit-learn to implement simple linear regression to the Titanic Data. We download a dataset that is related to fuel consumption and Carbon dioxide emission of cars. Then, we split our data into training and test sets, create a model using training set, evaluate your model using test set, and finally use model to predict unknown value.

In [3]:
import pandas as pd

In [6]:
df=pd.read_csv('train.csv')
df1=pd.read_csv('test.csv')

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
combine=[df,df1]

In [20]:
result = pd.concat(combine, ignore_index=True, sort=False)

In [21]:
result

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,NaN,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
1305,1306,NaN,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
1306,1307,NaN,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
1307,1308,NaN,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
1308,1309,NaN,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [23]:
result.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1309.000000,891.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.383838,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.486592,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

In [75]:
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 21 columns):
PassengerId    1309 non-null int64
Survived       891 non-null float64
Pclass         1309 non-null int64
Name           1309 non-null object
Sex            1309 non-null object
Age            1046 non-null float64
SibSp          1309 non-null int64
Parch          1309 non-null int64
Ticket         1309 non-null object
Fare           1308 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Pclass_1       1309 non-null int64
Pclass_2       1309 non-null int64
Pclass_3       1309 non-null int64
Title          1309 non-null object
IsFemale       1309 non-null int64
Miss           1309 non-null int64
Mrs            1309 non-null int64
Mr             1309 non-null int64
Rare           1309 non-null int64
dtypes: float64(3), int64(12), object(6)
memory usage: 214.9+ KB

In [33]:
result['Pclass_1']=(result['Pclass']==1).astype(int)
result['Pclass_2']=(result['Pclass']==2).astype(int)

In [52]:
result['IsFemale']=(result['Sex']=='female').astype(int)

In [70]:
result['Title'] = result.Name.str.extract(' ([A-Za-z]+)\.', expand=False)
pd.crosstab(result['Title'], result['Survived'])
#pd.crosstab(result['Age'], result['Survived'])
#pd.crosstab(result['Survived'], result['Age'])

Survived  0.0  1.0
Title
Capt        1    0
Col         1    1
Countess    0    1
Don         1    0
Dr          4    3
Jonkheer    1    0
Lady        0    1
Major       1    1
Master     17   23
Miss       55  127
Mlle        0    2
Mme         0    1
Mr        436   81
Mrs        26   99
Ms          0    1
Rev         6    0
Sir         0    1

In [71]:
result['Title'] = result['Title'].replace(['Col','Dr', 'Rev', 'Dona'], 'Rare')
result['Title'] = result['Title'].replace('Mlle', 'Miss')
result['Title'] = result['Title'].replace('Ms', 'Miss')
result['Title'] = result['Title'].replace('Mme', 'Mrs')

In [73]:
pd.crosstab(result['Title'], result['Survived'])

Survived  0.0  1.0
Title
Capt        1    0
Countess    0    1
Don         1    0
Jonkheer    1    0
Lady        0    1
Major       1    1
Master     17   23
Miss       55  130
Mr        436   81
Mrs        26  100
Rare       11    4
Sir         0    1

In [74]:
result['Miss']=(result['Title']=='Miss').astype(int)
result['Mrs']=(result['Title']=='Mrs').astype(int)
result['Mr']=(result['Title']=='Mr').astype(int)
result['Rare']=(result['Title']=='Rare').astype(int)

In [83]:
pd.crosstab(result['Survived'], [result['SibSp'],result['Sex']])
pd.crosstab(result['SibSp'], [result['Age'],result['Survived']])

Age      0.42  0.67  0.75  0.83  0.92  1.00      2.00      3.00   ... 62.00  \
Survived   1.0   1.0   1.0   1.0   1.0   0.0 1.0   0.0 1.0   0.0  ...   1.0
SibSp                                                             ...
0            1     0     0     1     0     0   2     1   1     0  ...     2
1            0     1     0     1     1     0   2     1   2     0  ...     0
2            0     0     2     0     0     0   1     0   0     0  ...     0
3            0     0     0     0     0     0   0     2   0     1  ...     0
4            0     0     0     0     0     1   0     3   0     0  ...     0
5            0     0     0     0     0     1   0     0   0     0  ...     0

Age      63.00 64.00 65.00 66.00 70.00 70.50 71.00 74.00 80.00
Survived   1.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   1.0
SibSp
0            1     1     3     1     1     1     2     1     1
1            1     1     0     0     1     0     0     0     0
2            0     0     0     0     0     0     0     0     0
3            0     0     0     0     0     0     0     0     0
4            0     0     0     0     0     0     0     0     0
5            0     0     0     0     0     0     0     0     0

[6 rows x 142 columns]

In [89]:
result.Name

0                                 Braund, Mr. Owen Harris
1       Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                  Heikkinen, Miss. Laina
3            Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                                Allen, Mr. William Henry
                              ...
1304                                   Spector, Mr. Woolf
1305                         Oliva y Ocana, Dona. Fermina
1306                         Saether, Mr. Simon Sivertsen
1307                                  Ware, Mr. Frederick
1308                             Peter, Master. Michael J
Name: Name, Length: 1309, dtype: object

In [91]:
result['Surname']=result.Name.str.extract('([A-Za-z]+),', expand=False)

In [98]:
result.groupby('Surname')['PassengerId'].nunique()

Surname
Abbing         1
Abbott         3
Abelseth       2
Abelson        2
Abrahamsson    1
              ..
Yrois          1
Zabour         2
Zakarian       2
Zimmerman      1
hoef           1
Name: PassengerId, Length: 872, dtype: int64

In [99]:
pd.crosstab(result['Parch'], result['Age'])

Age,0.17,0.33,0.42,0.67,0.75,0.83,0.92,1.00,2.00,3.00,...,64.00,65.00,66.00,67.00,70.00,70.50,71.00,74.00,76.00,80.00
Parch,,,,,,,,,,,,,,,,,,,,,
0,0,0,0,0,0,0,0,0,0,0,...,2,2,1,1,1,1,2,1,1,1
1,0,0,1,1,3,2,0,5,9,5,...,1,1,0,0,1,0,0,0,0,0
2,1,1,0,0,0,1,2,5,3,2,...,1,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,0
5,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
6,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [116]:
(result.Parch == 0) & (result.SibSp == 0)


result['IsAlone']=((result.Parch == 0) & (result.SibSp == 0)).astype(int)

In [120]:
pd.crosstab([result['IsAlone'],result['Parch']], [result['Survived'],result['Sex']])

Survived         0.0         1.0
Sex           female male female male
IsAlone Parch
0       0         14   57     54   16
        1         14   39     46   19
        2         19   21     30   10
        3          1    1      3    0
        4          2    2      0    0
        5          3    1      1    0
        6          1    0      0    0
1       0         27  347     99   64

In [112]:
result.SibSp == 0

0       False
1       False
2        True
3       False
4        True
        ...
1304     True
1305     True
1306     True
1307     True
1308    False
Name: SibSp, Length: 1309, dtype: bool